# Hands-on Lab : Sub-queries and Nested SELECTs

How does a typical Nested SELECT statement syntax look?

In [ ]:
SELECT column_name [, column_name ]
FROM table1 [, table2 ]
WHERE column_name OPERATOR
    (SELECT column_name [, column_name ]
    FROM table1 [, table2 ]
    WHERE condition);

Database Used in this Lab

In [4]:
SELECT * FROM EMPLOYEES;

EMP_ID,F_NAME,L_NAME,SSN,B_DATE,SEX,ADDRESS,JOB_ID,SALARY,MANAGER_ID,DEP_ID
E1001,John,Thomas,123456,1976-01-09,M,"""5631 Rice OakPark IL""",100,100000.00,30001,2
E1002,Alice,James,123457,1972-07-31,F,"""980 Berry ln Elgin IL""",200,80000.00,30002,5
E1003,Steve,Wells,123458,1980-08-10,M,"""291 Springs Gary IL""",300,50000.00,30002,5
E1004,Santosh,Kumar,123459,1985-07-20,M,"""511 Aurora Av Aurora IL""",400,60000.00,30004,5
E1005,Ahmed,Hussain,123410,1981-01-04,M,"""216 Oak Tree Geneva IL""",500,70000.00,30001,2
E1006,Nancy,Allen,123411,1978-02-06,F,"""111 Green Pl Elgin IL""",600,90000.00,30001,2
E1007,Mary,Thomas,123412,1975-05-05,F,"""100 Rose Pl Gary IL""",650,65000.00,30003,7
E1008,Bharath,Gupta,123413,1985-05-06,M,"""145 Berry Ln Naperville IL""",660,65000.00,30003,7
E1009,Andrea,Jones,123414,1990-07-09,F,"""120 Fall Creek Gary IL""",234,70000.00,30003,7
E1010,Ann,Jacob,123415,1982-03-30,F,"""111 Britany Springs Elgin IL""",220,70000.00,30004,5

## Objectives
---

After completing this lab you will be able to:

- Write SQL queries that demonstrate the necessity of using sub-queries
- Compose sub-queries in the where clause
- Build Column Expressions (i.e. sub-query in place of a column)
- Write Table Expressions (i.e. sub-query in place of a table)

# Exercise:
Problem 1: Execute a failing query (i.e. one which gives an error) to retrieve all employees records whose salary is lower than the average salary.

In [5]:
SELECT * FROM EMPLOYEES
WHERE SALARY < AVG(SALARY);

: Msg 147, Level 15, State 1, Line 2
An aggregate may not appear in the WHERE clause unless it is in a subquery contained in a HAVING clause or a select list, and the column being aggregated is an outer reference.

Problem 2: Execute a working query using a sub-select to retrieve all employees records whose salary is lower than the average salary.

In [6]:
SELECT * FROM EMPLOYEES
WHERE SALARY < (select AVG(SALARY) from EMPLOYEES);

EMP_ID,F_NAME,L_NAME,SSN,B_DATE,SEX,ADDRESS,JOB_ID,SALARY,MANAGER_ID,DEP_ID
E1003,Steve,Wells,123458,1980-08-10,M,"""291 Springs Gary IL""",300,50000.00,30002,5
E1004,Santosh,Kumar,123459,1985-07-20,M,"""511 Aurora Av Aurora IL""",400,60000.00,30004,5
E1005,Ahmed,Hussain,123410,1981-01-04,M,"""216 Oak Tree Geneva IL""",500,70000.00,30001,2
E1007,Mary,Thomas,123412,1975-05-05,F,"""100 Rose Pl Gary IL""",650,65000.00,30003,7
E1008,Bharath,Gupta,123413,1985-05-06,M,"""145 Berry Ln Naperville IL""",660,65000.00,30003,7
E1009,Andrea,Jones,123414,1990-07-09,F,"""120 Fall Creek Gary IL""",234,70000.00,30003,7
E1010,Ann,Jacob,123415,1982-03-30,F,"""111 Britany Springs Elgin IL""",220,70000.00,30004,5

Problem 3: Execute a failing query (i.e. one which gives an error) to retrieve all employees records with EMP_ID, SALARY and maximum salary as MAX_SALARY in every row.

In [7]:
SELECT EMP_ID, SALARY, MAX(SALARY) AS MAX_SALARY 
FROM EMPLOYEES;

: Msg 8120, Level 16, State 1, Line 1
Column 'EMPLOYEES.EMP_ID' is invalid in the select list because it is not contained in either an aggregate function or the GROUP BY clause.

Problem 4: Execute a Column Expression that retrieves all employees records with EMP_ID, SALARY and maximum salary as MAX_SALARY in every row.

In [8]:
SELECT EMP_ID, SALARY,
        (select MAX(SALARY) FROM EMPLOYEES) AS MAX_SALARY
        FROM EMPLOYEES;

EMP_ID,SALARY,MAX_SALARY
E1001,100000.00,100000.00
E1002,80000.00,100000.00
E1003,50000.00,100000.00
E1004,60000.00,100000.00
E1005,70000.00,100000.00
E1006,90000.00,100000.00
E1007,65000.00,100000.00
E1008,65000.00,100000.00
E1009,70000.00,100000.00
E1010,70000.00,100000.00

Problem 5: Execute a Table Expression for the EMPLOYEES table that excludes columns with sensitive employee data (i.e. does not include columns: SSN, B_DATE, SEX, ADDRESS, SALARY).

In [9]:
SELECT * FROM
        (select EMP_ID, F_NAME, L_NAME, DEP_ID 
            FROM EMPLOYEES) AS EMP4ALL;

EMP_ID,F_NAME,L_NAME,DEP_ID
E1001,John,Thomas,2
E1002,Alice,James,5
E1003,Steve,Wells,5
E1004,Santosh,Kumar,5
E1005,Ahmed,Hussain,2
E1006,Nancy,Allen,2
E1007,Mary,Thomas,7
E1008,Bharath,Gupta,7
E1009,Andrea,Jones,7
E1010,Ann,Jacob,5